{
    "A": {
        "Amministratore": "utente con privilegi avanzati su tutto il sistema di Stalker, esegue operazioni amministrative e gestisce le richieste che provengono da utenti con permessi limitati.",
        "Account": "il complesso dei dati identificativi di un utente, che gli consentono l'accesso all'applicazione mobile oppure alla web application",
        "amministratore": "toDelete",
        "Applicazione mobile": "applicazione software dedicata ai dispositivi di tipo mobile, quali smartphone o tablet. ",
        "aree d'interesse": "toDelete",
        "attività": ""
    },
    "B": {
        "Back-end": "parte di un software con il quale l’utente interagisce indirettamente, ma che è essenziale per il funzionamento del sistema."
    },
    "C": {
        "Capitolato": "documento tecnico redatto dall'azienda committente, contenente tutte le specifiche tecniche del prodotto software che devono essere rispettate ed eseguite dall'azienda fornitrice per effetto di un contratto d'appalto.",
        "Caso d'uso": "insieme di scenari, ovvero sequenze di azioni, che hanno in comune uno scopo finale per un attore, ovvero un utente. Descrivono l’insieme di funzionalità del sistema percepite dall'utente.",
        "Client": "componente che accede ai servizi o alle risorse di un'altra componente detta server."
    },
    "D": {
        "Dato": "valore privo di significato, che lo assume se associato in determinati contesti significativi",
        "Documento": "entità fisica o digitale atta a registrare informazioni significative."
    },
    "E": {
        "EULA": "acronimo di End-User License Agreement, è il contratto tra il fornitore di un programma software e l'utente finale. Se l'utente accetta tale contratto, gli verrà assegnata la licenza d'uso del programma nei termini stabiliti dal contratto stesso."
    },
    "F": {
        "Fase": "segmento temporale delimitato da un inizio e una fine, nel quale avvengono delle transazioni coerenti tra stati.",
        "fasi di incremento": "",
        "Front-end": "parte di un software visibile all'utente e con cui egli può interagire tramite un interfaccia utente."
    },
    "G": {
        "Gestore": "utente appartenente ad un'organizzazione abilitato a gestire i luoghi dell'organizzazione. Un singolo utente può essere gestore di più organizzazioni distinte.",
        "gestore": "toDelete"
    },
    "H": {
        "Hangouts": "web application di Google utilizzata da GruppOne per la messaggistica istantanea e videoconferenza."
    },
    "I": {
        "Imola Informatica": "proponente del capitolato per il progetto Stalker."
    },
    "J": {},
    "K": {},
    "L": {
        "Link": "collegamento ad un'altra pagina.",
        "Luogo": "spazio fisico indentificato da un insieme di coordinate geografiche. Ciascun luogo è riconducibile ad un'organizzazione."
    },
    "M": {
        "Modello incrementale": "modello di sviluppo del software atto a procedere per incrementi continui del sistema, con la caratteristica che il software sviluppato prima di un incremento è valido ciò che è stato aggiunto. L’incremento deve essere di qualità per attenersi ai requisiti del prodotto finale",
        "Modello client/server": "modello architetturale di sistemi distribuiti, organizzato come un insieme di servizi associati a uno o più server, e di client che accedono e utilizzano tali servizi."
    },
    "N": {
        "Notifica": "messaggio che viene spedito all'utente direttamente dal server, a causa del verificarsi di un evento indipendente dalle richieste dell'utente."
    },
    "O": {
        "Owner": "utente proprietario di una o più organizzazioni, ha privilegi di gestione dell'organizzazione su cui opera e dei suoi gestori e visualizzatori. Un singolo utente può essere owner di più organizzazioni distinte.",
        "Organizzazione": "soggetto che ha interesse a tracciare le presenze delle persone all’interno dei propri luoghi, in maniera anonima o autenticata.",
        "owner": "toDelete"
    },
    "P": {
        "periodi": "",
        "Postcondizione": "condizione che deve essere sempre vera immediatamente dopo l'uscita dallo scenario di un caso d'uso specifico.",
        "Precondizione": "condizione che deve essere sempre vera prima di accedere allo scenario di un caso d'uso specifico.",
        "Prodotto": "entità software progettata per essere rilasciata all'utente.",
        "Progetto": "insieme di processi, attività e compiti progettato e svolto dal fornitore, per raggiungere gli obiettivi prestabiliti dai requisiti obbligatori, in un arco temporale fissato nel contratto stipulato con il proponente e con risorse limitate che si esauriscono con l'avanzare del tempo.",
        "Proponente": "azienda che presenta una proposta di contratto."
    },
    "Q": {
        "Query": "interrogazione da parte di un utente di un database, per estrarre o aggiornare i dati che soddisfano un certo criterio di ricerca."
    },
    "R": {
        "Report": "insieme di dati opportunamente estrapolati e/o elaborati, organizzati sotto forma tabellare.",
        "Requisiti": "necessità del committente, legate al prodotto software da realizzare, che devono essere oblligatoriamente soddisfatte dal fornitore."
    },
    "S": {
        "Stalker": "nome del progetto proposto dall'azienda Imola Informatica.",
        "Server": "componente o sistema informatico di elaborazione e gestione del traffico di informazioni che fornisce servizi ad altre componenti dette client.",
        "Server LDAP": "Server che utilizza il protocollo standard LDAP, acronimo di Lightweight Directory Access Protocol. LDAP è un protocollo d'accesso, basato sul modello client-server, a servizi di directory che opera su TCP/IP o su altre connessioni orientate al servizio.",
        "Smartphone": "apparecchio elettronico che combina le funzioni di un telefono cellulare e di un computer palmare.",
        "Software": "insieme delle procedure e delle istruzioni in un sistema di elaborazione dati.",
        "stima": ""
    },
    "T": {},
    "U": {
        "UML": "acronimo di Unified Modeling Language, rappresenta un linguaggio visuale che si basa su un insieme di regole, vincoli e teorie utilizzate per la modellazione di una classe di problemi. Serve a supportare la descrizione dei sistemi software",
        "Utente autenticato": "utente non autenticato che ha effettuato l'autenticazione alla piattaforma dall'applicazione mobile oppure alla web application.",
        "Utente collegato": "utente autenticato che è collegato ad almeno un'organizzazione;",
        "Utente collegato incognito": "utente collegato ad un'organizzazione in modalità incognito, in quanto la sua identità non è conosciuta.",
        "Utente collegato noto": "utente collegato ad un'organizzazione in modalità noto, in quanto la sua identità è conosciuta.",
        "Utente non autenticato": "utente che non ha ancora effettuato l'autenticazione all'applicazione mobile oppure alla web application.",
        "Utente non collegato": "utente autenticato che non ha effettuato alcun collegamento ad un'organizzazione.",
        "Utente": "soggetto che ha interesse ad utilizzare il software prodotto da GruppOne.",
        "utente autenticato": "toDelete",
        "utente collegato": "toDelete",
        "utente generico": "toDelete",
        "utente non autenticato": "toDelete",
        "utenti anonimi": "toDelete",
        "utenti autenticati": "toDelete"
    },
    "V": {
        "Visualizzatore": "utente appartenente ad un'organizzazione abilitato esclusivamente a visualizzare i luoghi dell'organizzazione. Un singolo utente può essere visualizzatore di più organizzazioni distinte.",
        "visualizzatore": "toDelete"
    },
    "W": {
        "Web application": "applicazione distribuita accessibile in una rete Internet per mezzo di un'architettura client/server."
    },
    "X": {},
    "Y": {},
    "Z": {}
}
