{
  "A": {
      "Account": "il complesso dei dati identificativi di un utente, che gli consentono l'accesso all'applicazione mobile oppure alla web application.",
      "Amministratore": "utente con privilegi avanzati su tutto il sistema di Stalker, esegue operazioni amministrative e gestisce le richieste che provengono da utenti con permessi limitati.",
      "Applicazione mobile": "applicazione software dedicata ai dispositivi di tipo mobile, quali smartphone o tablet. ",
      "Attività": "parte di un processo che indica l'insieme di compiti da realizzare per realizzare il prodotto finale e soddisfarne i requisiti.",
      "amministratore": "toDelete",
      "applicazione mobile": "toDelete",
      "aree d'interesse": "toDelete",
      "attività": "toDelete"
  },
  "B": {
      "Back-end": "parte di un software con il quale l'utente interagisce indirettamente, ma che risulta essenziale per il funzionamento del sistema."
  },
  "C": {
      "Capitolato": "documento tecnico redatto dall'azienda committente, contenente tutte le specifiche tecniche del prodotto software che devono essere rispettate ed eseguite dall'azienda fornitrice per effetto di un contratto d'appalto.",
      "Caso d'uso": "insieme di scenari, ovvero sequenze di azioni, che hanno in comune uno scopo finale per un attore, ovvero un utente. Descrivono l'insieme di funzionalità del sistema percepite dall'utente.",
      "Client": "componente che accede ai servizi o alle risorse di un'altra componente detta server.",
      "Commit": "comando di Git utilizzato per salvare i propri cambiamenti nella repository locale del progetto.",
      "Commitizen": "strumento da riga di comando che consente di formattare i messaggi di commit con una serie di prompt utilizzati per generare un messaggio di commit.",
      "Commitizen adapter": "meccanismo attraverso cui la utility Commitizen permette di applicare specifiche diverse, caso per caso, ai messaggi di commit",
      "Copertura": "nelle telecomunicazioni, è la zona geografica servita da una rete di telefonia cellulare o stazione radio.",
      "client": "toDelete",
      "copertura": "toDelete"
  },
  "D": {
      "Dato": "valore privo di significato, che lo assume se associato in determinati contesti significativi.",
      "Design pattern": "Soluzione progettuale generale a un problema ricorrente. È la descrizione di un modello da applicare per risolvere un problema, il quale può presentarsi in diverse situazioni durante la progettazione e lo sviluppo del software. Ogni design pattern ha il suo campo applicativo in base alle precondizioni del problema, coi suoi pregi e difetti.",
      "Documento": "entità fisica o digitale atta a registrare informazioni significative.",
      "dati": "toDelete"
  },
  "E": {
      "EULA": "acronimo di End-User License Agreement, è il contratto tra il fornitore di un programma software e l'utente finale. Se l'utente accetta tale contratto, gli verrà assegnata la licenza d'uso del programma nei termini stabiliti dal contratto stesso."
  },
  "F": {
      "Fase": "segmento temporale delimitato da un inizio e una fine, nel quale avvengono delle transazioni coerenti tra stati.",
      "Fase di incremento": "fase nella quale la parte da integrare nel software da aggiungere viene verificata e, solo in caso di accettazione, questa viene integrata nel software, rispettando la logica del modello incrementale.",
      "Front-end": "parte di un software visibile all'utente e con cui egli può interagire tramite un interfaccia utente.",
      "fasi": "toDelete",
      "fasi di incremento": "toDelete"
  },
  "G": {
      "GPS": "acronimo di Global Positioning System, è un sistema di posizionamento satellitare che permette in ogni istante di localizzare la latitudine e la longitudine di un oggetto, grazie all'utilizzo di satelliti che stazionano nell'orbita terrestre.",
      "Gestore": "utente appartenente ad un'organizzazione abilitato a gestire i luoghi dell'organizzazione. Un singolo utente può essere gestore di più organizzazioni distinte.",
      "Git": "sistema di controllo versione distribuito, in inglese DVCS (acronimo di Distributed Version Control System), utilizzabile da interfaccia a riga di comando. Utile per gestire progetti che siano tracciabili sia in locale che in remoto.",
      "gestore": "toDelete"
  },
  "H": {
      "Hangouts": "web application di Google utilizzata da GruppOne per la messaggistica istantanea e videoconferenza."
  },
  "I": {
      "Imola Informatica": "proponente del capitolato per il progetto Stalker."
  },
  "J": {
      "Java": "linguaggio di programmazione ad alto livello, orientato agli oggetti e a tipizzazione statica, progettato per essere il più possibile indipendente dalla piattaforma di esecuzione.",
      "Javascript": "linguaggio di scripting orientato agli oggetti e agli eventi, comunemente utilizzato nella programmazione web lato client per gestire gli effetti dinamici interattivi.",
      "javascript": "toDelete"
  },
  "K": {
      "Kubernetes": "piattaforma open source per automatizzare la distribuzione, la scalabilità e la gestione di applicazioni containerizzate."
  },
  "L": {
      "LDAP": "acronimo di Lightweight Directory Access Protocol, LDAP è un protocollo d'accesso a servizi di directory, basato sul modello client-server, che opera su TCP/IP o su altre connessioni orientate al servizio.",
      "Link": "collegamento ad un'altra pagina.",
      "Luogo": "spazio fisico indentificato da un insieme di coordinate geografiche. Ciascun luogo è riconducibile ad un'organizzazione."
  },
  "M": {
      "Modello a V": "modello di sviluppo del software che dimostra la relazione tra ogni fase del ciclo di vita dello sviluppo del software e la sua fase di testing.",
      "Modello client/server": "modello architetturale di sistemi distribuiti, organizzato come un insieme di servizi associati a uno o più server, e di client che accedono e utilizzano tali servizi.",
      "Modello incrementale": "modello di sviluppo del software atto a procedere per incrementi continui del sistema, con la caratteristica che tutto il software sviluppato prima di un incremento è valido. L'incremento deve essere di qualità per attenersi ai requisiti del prodotto finale.",
      "modello incrementale": "toDelete",
      "modello server/client": "toDelete"
  },
  "N": {
      "NodeJS": "ambiente di runtime JavaScript open source multipiattaforma orientato agli eventi per l'esecuzione di codice JavaScript.",
      "Notifica": "messaggio che viene spedito all'utente direttamente dal server, a causa del verificarsi di un evento indipendente dalle richieste dell'utente."
  },
  "O": {
      "Organizzazione": "soggetto che ha interesse a tracciare le presenze delle persone all'interno dei propri luoghi, in maniera anonima o autenticata.",
      "Owner": "utente proprietario di una o più organizzazioni, ha privilegi di gestione dell'organizzazione su cui opera e dei suoi gestori e visualizzatori. Un singolo utente può essere owner di più organizzazioni distinte.",
      "organizzazioni": "toDelete",
      "owner": "toDelete"
  },
  "P": {
      "Pattern Publisher/Subscriber": "Design pattern utilizzato per la comunicazione asincrona fra diversi processi. In questo schema, mittenti e destinatari di messaggi dialogano attraverso un tramite, che può essere detto dispatcher o broker. Il mittente di un messaggio (detto publisher) non deve essere consapevole dell'identità dei destinatari (detti subscriber); esso si limita a pubblicare il proprio messaggio al dispatcher. I destinatari si rivolgono a loro volta al dispatcher abbonandosi alla ricezione di messaggi. Il dispatcher quindi inoltra ogni messaggio inviato da un publisher a tutti i subscriber interessati a quel messaggio.",
      "Periodo": "Spazio di tempo caratterizzato da particolari condizioni o avvenimenti.",
      "Postcondizione": "condizione che deve essere sempre vera immediatamente dopo l'uscita dallo scenario di un caso d'uso specifico.",
      "Precondizione": "condizione che deve essere sempre vera prima di accedere allo scenario di un caso d'uso specifico.",
      "Prodotto": "entità software progettata per essere rilasciata all'utente.",
      "Progetto": "insieme di processi, attività e compiti progettato e svolto dal fornitore, per raggiungere gli obiettivi prestabiliti dai requisiti obbligatori, in un arco temporale fissato nel contratto stipulato con il proponente e con risorse limitate che si esauriscono con l'avanzare del tempo.",
      "Proof of concept": "realizzazione incompleta di un determinato progetto, allo scopo di provare il funzionamento base dell'applicativo software e il conseguimento di alcuni requisiti.",
      "Proponente": "azienda che presenta una proposta di contratto.",
      "Python": "linguaggio di programmazione dinamico orientato agli oggetti utilizzabile per molti tipi di sviluppo software. Offre un forte supporto all'integrazione con altri linguaggi e programmi.",
      "periodi": "toDelete",
      "postcondizioni": "toDelete",
      "precondizioni": "toDelete",
      "progetto": "toDelete",
      "proof of concept": "toDelete"
  },
  "Q": {
      "Query": "interrogazione da parte di un utente di un database, per estrarre o aggiornare i dati che soddisfano un certo criterio di ricerca.",
      "query": "toDelete"
  },
  "R": {
      "Report": "insieme di dati opportunamente estrapolati e/o elaborati, organizzati sotto forma tabellare.",
      "Requisiti": "necessità del committente, legate al prodotto software da realizzare, che devono essere obbligatoriamente soddisfatte dal fornitore.",
      "report": "toDelete"
  },
  "S": {
      "Scalabilità": "parametro di qualità, che indica la capacità di un sistema di aumentare o diminuire in modo dinamico le risorse a sua disposizione in funzione delle necessità e disponibilità. Ai fini di questo progetto si parla di scalabilità di carico, ovvero la capacità di un sistema di incrementare le proprie prestazioni, e può essere di due tipi: verticale, che consiste in una scalabilità hardware in cui si aumentano le risorse fisiche a disposizione, e orizzontale, che consiste nell’aggiunta di più istanze dell’applicazione.",
      "Server": "componente o sistema informatico di elaborazione e gestione del traffico di informazioni che fornisce servizi ad altre componenti dette client.",
      "Server LDAP": "server che utilizza il protocollo standard LDAP per l'autenticazione degli utenti ad un'organizzazione, se questa la prevede.",
      "Smartphone": "apparecchio elettronico che combina le funzioni di un telefono cellulare e di un computer palmare.",
      "Software": "insieme delle procedure e delle istruzioni in un sistema di elaborazione dati.",
      "Stalker": "nome del progetto proposto dall'azienda Imola Informatica.",
      "Stima": "previsione e valutazione del valore economico e del tempo da impiegare nell'ambito di un progetto.",
      "scalabilità": "toDelete",
      "server": "toDelete",
      "smartphone": "toDelete",
      "software": "toDelete",
      "stima": "toDelele"
  },
  "T": {
      "Telegram": "servizio di messaggistica istantanea e broadcasting basato sul cloud.",
      "Tracciatura": "rilevamento della presenza di un'utente autenticato all’interno di un luogo. Può essere anonima quando l'utente non è autenticato nell’organizzazione di riferimento, oppure autenticata quando l'utente è autenticato nell’organizzazione di riferimento.",
      "tracciatura": "toDelete"
  },
  "U": {
      "UML": "acronimo di Unified Modeling Language, rappresenta un linguaggio visuale che si basa su un insieme di regole, vincoli e teorie utilizzate per la modellazione di una classe di problemi. Serve a supportare la descrizione dei sistemi software",
      "Utente": "soggetto che ha interesse ad utilizzare il software prodotto da GruppOne.",
      "Utente autenticato": "utente non autenticato che ha effettuato l'autenticazione alla piattaforma dall'applicazione mobile oppure alla web application.",
      "Utente collegato": "utente autenticato che è collegato ad almeno un'organizzazione;",
      "Utente collegato incognito": "utente collegato ad un'organizzazione in modalità incognito, in quanto la sua identità non è conosciuta.",
      "Utente collegato noto": "utente collegato ad un'organizzazione in modalità noto, in quanto la sua identità è conosciuta.",
      "Utente non autenticato": "utente che non ha ancora effettuato l'autenticazione all'applicazione mobile oppure alla web application.",
      "Utente non collegato": "utente autenticato che non ha effettuato alcun collegamento ad un'organizzazione.",
      "utente": "toDelete",
      "utente autenticato": "toDelete",
      "utente collegato": "toDelete",
      "utente generico": "toDelete",
      "utente non autenticato": "toDelete",
      "utenti anonimi": "toDelete",
      "utenti autenticati": "toDelete"
  },
  "V": {
      "Visualizzatore": "utente appartenente ad un'organizzazione abilitato esclusivamente a visualizzare i luoghi dell'organizzazione. Un singolo utente può essere visualizzatore di più organizzazioni distinte.",
      "visualizzatore": "toDelete"
  },
  "W": {
      "Web application": "applicazione distribuita accessibile in una rete Internet per mezzo di un'architettura client/server."
  },
  "X": {},
  "Y": {},
  "Z": {}
}
